; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	thermograph7 - mode
	thermograph5 - mode
	image1 - mode
	thermograph4 - mode
	image8 - mode
	image2 - mode
	image0 - mode
	spectrograph3 - mode
	infrared6 - mode
	Star0 - direction
	GroundStation2 - direction
	Star3 - direction
	Star4 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 image8)
	(supports instrument0 thermograph4)
	(supports instrument0 thermograph7)
	(supports instrument0 infrared6)
	(supports instrument0 spectrograph3)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon7)
	(supports instrument1 image2)
	(supports instrument1 image0)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
)
(:goal (and
	(pointing satellite1 Star6)
	(have_image Phenomenon7 spectrograph3)
	(have_image Phenomenon7 thermograph4)
	(have_image Phenomenon7 image8)
	(have_image Planet8 image1)
	(have_image Planet8 image2)
	(have_image Phenomenon9 thermograph7)
	(have_image Phenomenon9 image2)
	(have_image Phenomenon10 thermograph4)
	(have_image Phenomenon10 thermograph7)
	(have_image Phenomenon10 image2)
	(have_image Planet11 thermograph4)
))

)

; plan
1. (turn_to satellite1 groundstation1 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 12
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 12
3. (calibrate satellite1 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 12
4. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 0 of 12
5. (take_image satellite1 planet8 instrument1 image2)
   added: (have_image planet8 image2)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon9 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon9 instrument1 image2)
   added: (have_image phenomenon9 image2)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation5 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation5)
   goals met: 2 of 12
10. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 12
11. (calibrate satellite0 instrument0 groundstation5)
   added: (calibrated instrument0)
   goals met: 2 of 12
12. (take_image satellite1 phenomenon10 instrument1 image2)
   added: (have_image phenomenon10 image2)
   goals met: 3 of 12
13. (turn_to satellite0 phenomenon10 groundstation5)
   deleted: (pointing satellite0 groundstation5)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 12
14. (take_image satellite0 phenomenon10 instrument0 thermograph4)
   added: (have_image phenomenon10 thermograph4)
   goals met: 4 of 12
15. (take_image satellite0 phenomenon10 instrument0 thermograph7)
   added: (have_image phenomenon10 thermograph7)
   goals met: 5 of 12
16. (turn_to satellite0 phenomenon7 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon7)
   goals met: 5 of 12
17. (take_image satellite0 phenomenon7 instrument0 image8)
   added: (have_image phenomenon7 image8)
   goals met: 6 of 12
18. (take_image satellite0 phenomenon7 instrument0 spectrograph3)
   added: (have_image phenomenon7 spectrograph3)
   goals met: 7 of 12
19. (take_image satellite0 phenomenon7 instrument0 thermograph4)
   added: (have_image phenomenon7 thermograph4)
   goals met: 8 of 12
20. (turn_to satellite0 phenomenon9 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon9)
   goals met: 8 of 12
21. (take_image satellite0 phenomenon9 instrument0 thermograph7)
   added: (have_image phenomenon9 thermograph7)
   goals met: 9 of 12
22. (turn_to satellite0 planet11 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet11)
   goals met: 9 of 12
23. (take_image satellite0 planet11 instrument0 thermograph4)
   added: (have_image planet11 thermograph4)
   goals met: 10 of 12
24. (turn_to satellite0 planet8 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet8)
   goals met: 10 of 12
25. (take_image satellite0 planet8 instrument0 image1)
   added: (have_image planet8 image1)
   goals met: 11 of 12
26. (turn_to satellite1 star6 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 star6)
   goals met: 12 of 12
